Tekla.Structures.Model.RebarSpacing
The RebarSpacing class defines spacing properties for a Tekla.Structures.Model.RebarGuideline.

Tekla.Structures.Model.RebarSpacing.startOffset
The start offset

Tekla.Structures.Model.RebarSpacing.endOffset
The end offset

Tekla.Structures.Model.RebarSpacing.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarSpacing class.

Tekla.Structures.Model.RebarSpacing.#ctor(Tekla.Structures.Model.RebarSpacing.SpacingType,Tekla.Structures.Model.RebarSpacing.Offset,Tekla.Structures.Model.RebarSpacing.Offset)
Initializes a new instance of the Tekla.Structures.Model.RebarSpacing class.
type: The type of spacing.
startOffset: The start offset.
endOffset: The end offset.

Tekla.Structures.Model.RebarSpacing.Type
Gets or sets the type of spacing. Does not allow change to exact spacing or number bars spacing.

Tekla.Structures.Model.RebarSpacing.NumberOfBars
Gets or sets the number of bars in the spacing object.

Tekla.Structures.Model.RebarSpacing.TargetSpace
Gets or sets the target space.

Tekla.Structures.Model.RebarSpacing.ExactSpace
Gets or sets the exact space.

Tekla.Structures.Model.RebarSpacing.ExactElements
Gets or sets the exact elements of the spacing.

Tekla.Structures.Model.RebarSpacing.Zones
Gets or sets the spacing zones.
Deprecated since TS2022, please use other spacing definitions instead.

Tekla.Structures.Model.RebarSpacing.StartOffset
Gets or sets the proposed offset to the first reinforcing bar from the start of the Tekla.Structures.Model.RebarGuideline.

Tekla.Structures.Model.RebarSpacing.EndOffset
Gets or sets the proposed offset to the last reinforcing bar from the end of the Tekla.Structures.Model.RebarGuideline.

Tekla.Structures.Model.RebarSpacing.StartOffsetType
Gets or sets a value indicating whether the start offset is exact or minimum.
If the start offset is minimum the spacing algorithm may determine a larger offset.
Deprecated since TS2022, only exact spacing is to be supported.

Tekla.Structures.Model.RebarSpacing.EndOffsetType
Gets or sets a value indicating whether the end offset is exact or minimum.
If the end offset is minimum the spacing algorithm may determine a larger offset.
Deprecated since TS2022, only exact spacing is to be supported.

Tekla.Structures.Model.RebarSpacing.StartOffsetIsAutomatic
Gets or sets a value indicating whether the start offset is automatic.
When automatic the proposed start offset is calculated to be the concrete cover thickness plus half the reinforcing bar diameter.

Tekla.Structures.Model.RebarSpacing.EndOffsetIsAutomatic
Gets or sets a value indicating whether the end offset is automatic.
When automatic the proposed end offset is calculated to be the concrete cover thickness plus half the reinforcing bar diameter.

Tekla.Structures.Model.RebarSpacing.ExcludeType
Gets or sets the exclusion of first and last bars.

Tekla.Structures.Model.RebarSpacing.InheritFromPrimary
Gets or sets a value indicating whether the secondary guideline inherits all its spacing properties from the
primary guideline.
This property is not applicable to a primary guideline.

Tekla.Structures.Model.RebarSpacing.InheritOffsetsFromPrimary
Gets or sets a value indicating whether the secondary guideline inherits its start and end offsets from the
primary guideline.
This property is not applicable to a primary guideline.

Tekla.Structures.Model.RebarSpacing.Create(Tekla.Structures.Model.RebarSpacing.Offset,Tekla.Structures.Model.RebarSpacing.Offset,System.Int32)
Craetes a spacing defined by number of bars.
startOffset: The start offset.
endOffset: The end offset.
number: The number of bars.
Returns: A Tekla.Structures.Model.RebarSpacing instance.

Tekla.Structures.Model.RebarSpacing.Create(Tekla.Structures.Model.RebarSpacing.SpacingType,Tekla.Structures.Model.RebarSpacing.Offset,Tekla.Structures.Model.RebarSpacing.Offset,System.Double)
Create a spacing which is defined by a single distance.
type: The type of spacing.
startOffset: The start offset.
endOffset: The end offset.
distance: The spacing distance.
Returns: A Tekla.Structures.Model.RebarSpacing instance if the given type and distance are valid.

Tekla.Structures.Model.RebarSpacing.Create(Tekla.Structures.Model.RebarSpacing.Offset,Tekla.Structures.Model.RebarSpacing.Offset,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element},Tekla.Structures.Model.RebarSpacing.ExactSpacing.Validation@)
Creates an exact spacing if the given elements are valid.
startOffset: The start offset.
endOffset: The end offset.
elements: The elements.
validation: Returns a value indicating the validity of the elements.
Returns: A Tekla.Structures.Model.RebarSpacing instance.

Tekla.Structures.Model.RebarSpacing.IsExactFlexibleType(Tekla.Structures.Model.RebarSpacing.SpacingType)
Gets whether the spacing is an exact type with flexible space(s).
type: The spacing type.
Returns: True if it is an exact flexible type spacing.

Tekla.Structures.Model.RebarSpacing.Clone
Makes a copy of this object.
Returns: a new Tekla.Structures.Model.RebarSpacing instance.

Tekla.Structures.Model.RebarSpacing.FromStructs(Tekla.Structures.ModelInternal.dotRebarSpacing_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t},System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t})
The from structs method.
dotSpacing: The dot rebar spacing struct.
dotSpacingZoneList: The dot zones.
dotSpacingElementList: The dot spacing elements.
Returns: A Tekla.Structures.Model.RebarSpacing instance.

Tekla.Structures.Model.RebarSpacing.ToStructs(Tekla.Structures.ModelInternal.dotRebarSpacing_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t},System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t})
The to structs method.
dotSpacing: The dot rebar spacing struct.
dotSpacingZoneList: The dot zones.
dotSpacingElementList: The dot spacing elements.